In [1]:
#Ejercicio 1

In [2]:
import pandas as pd
import warnings
warnings.simplefilter('ignore') #esta linea y la de arriba ponen fin a la apariciÃ³n de warnings

In [3]:
%pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in /home/sergiooo/.local/lib/python3.8/site-packages (1.4.31)
Requirement already satisfied: greenlet!=0.4.17; python_version >= "3" and (platform_machine == "aarch64" or (platform_machine == "ppc64le" or (platform_machine == "x86_64" or (platform_machine == "amd64" or (platform_machine == "AMD64" or (platform_machine == "win32" or platform_machine == "WIN32")))))) in /home/sergiooo/.local/lib/python3.8/site-packages (from SQLAlchemy) (1.1.2)
Note: you may need to restart the kernel to use updated packages.

In [4]:
from sqlalchemy import create_engine

In [5]:
%pip install pymysql

Requirement already satisfied: pymysql in /home/sergiooo/.local/lib/python3.8/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [6]:
str_conn='mysql+pymysql://root:admin@localhost:3306'
motor=create_engine(str_conn)

In [11]:
motor.execute("SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''));") #comando fin error 1055
motor.execute(use publications) #comando seleccion la base de datos sobre la que trabajar 
pd.read_sql('select * from sales', motor).head()

  stor_id   ord_num   ord_date  qty    payterms title_id
0    6380      6871 1994-09-14    5      Net 60   BU1032
1    6380      722a 1994-09-13    3      Net 60   PS2091
2    7066     A2976 1993-05-24   50      Net 30   PC8888
3    7066  QA7442.3 1994-09-13   75  ON invoice   PS2091
4    7067     D4482 1994-09-14   10      Net 60   PS2091

In [16]:
pd.read_sql(''' 
             SELECT
authors.au_id as Author_ID, 
titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100 as Sales_royalty,
titles.title_id as Title_ID


FROM
authors

LEFT JOIN titleauthor 
on authors.au_id = titleauthor.au_id
LEFT JOIN titles
on titleauthor.title_id = titles.title_id
LEFT JOIN sales
on titles.title_id = sales.title_id
group by author_id, title_id
order by Sales_royalty DESC
limit 3
          ''', motor).head() #solucionado el 1, entre las comillas esta la queri, podria usarse directamente en mysql workbench

     Author_ID  Sales_royalty Title_ID
0  238-95-7766         110.16   PC1035
1  807-91-6654          83.80   TC3218
2  427-17-2319          50.00   PC8888

In [ ]:
#motor.execute('select * from sales').fetchall() #me saca por pantalla la info pero en vez de en dataframe me la saca a modo de tuplas

In [17]:
#Ejercicio 2

In [23]:
motor.execute('''create temporary table publications.author_royalties
               select Author_id, sales_royalty
                  from
                                   
                       (SELECT
authors.au_id as Author_ID, 
titles.price * sales.qty * titles.royalty / 100 * titleauthor.royaltyper / 100 as Sales_royalty,
titles.title_id as Title_ID


FROM
authors

LEFT JOIN titleauthor 
on authors.au_id = titleauthor.au_id
LEFT JOIN titles
on titleauthor.title_id = titles.title_id
LEFT JOIN sales
on titles.title_id = sales.title_id
group by author_id, title_id
order by Sales_royalty DESC
limit 3)royalty;
''')

In [24]:
#Ejercicio 3

In [25]:
motor.execute('''create table most_profiting_authors
select Author_id, sales_royalty
FROM author_royalties''')